{"modelTopology": {"training_config": {"metrics": ["accuracy"], "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false, "lr": 0.0010000000474974513}}, "sample_weight_mode": null, "loss_weights": null}, "keras_version": "2.2.4", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "batch_input_shape": [null, 20], "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.9, "seed": null, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 4, "use_bias": true, "activity_regularizer": null}}], "name": "sequential_1"}}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [20, 16], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [16], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [16, 4], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [4], "name": "dense_2/bias"}]}]}